using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Tanciki
{
    public class Map
    {
        private static Map _instance;
        private Map() { }
        public static Map GetInstance()
        {
            if (_instance == null)
            {
                _instance = new Map();
            }
            return _instance;
        }

        //0-пустота
        //1-вода
        //2-стена целая
        //3-стена поломаная
        //4-пуля
        //5-танк игрок вверх
        //6-танк игрок вправо
        //7-танк игрок вниз
        //8-танк игрок влево
        //9-танк враг вверх
        //10-танк враг вправо
        //11-танк враг вниз
        //12-танк враг влево
        public List<ConsoleColor> NumberToColor = new List<ConsoleColor>() {ConsoleColor.Black,ConsoleColor.Blue,ConsoleColor.DarkRed,ConsoleColor.DarkRed,ConsoleColor.White,ConsoleColor.Green,ConsoleColor.Green,ConsoleColor.Green,ConsoleColor.Green,ConsoleColor.DarkYellow,ConsoleColor.DarkYellow,ConsoleColor.DarkYellow,ConsoleColor.DarkYellow};
        public List<char[]> NumberToBlock = new List<char[]>() { new char[] {' ',' ',' ', ' ' }, new char[] { '~','~','~', '~' }, new char[] { '█', '█', '█', '█' }, new char[] { '#', '#', '#', '#' }, new char[] { '¤', '¤', '¤', '¤' }, new char[] { '╝', '╚', '█', '█' }, new char[] { '█', '╚', '█', '╔' }, new char[] { '█', '█', '╗', '╔' }, new char[] { '╝', '█', '╗', '█' } , new char[] { '╝', '╚', '█', '█' }, new char[] { '█', '╚', '█', '╔' }, new char[] { '█', '█', '╗', '╔' }, new char[] { '╝', '█', '╗', '█' }  };
        public int[,] MainMap;
        public int[,] MapStart =
        {
            {2,2,2,2,2,2,2,2,2,2},
            {2,2,2,2,2,0,0,0,2,2},
            {2,2,0,2,2,0,0,0,2,2},
            {2,2,0,2,2,1,0,0,2,2},
            {2,2,2,2,1,1,1,0,2,2},
            {2,2,2,2,1,1,1,0,0,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,0,0,2,2,2,2,0,2,2},
            {2,0,0,0,0,0,2,0,0,2},
            {2,2,2,2,2,2,2,2,2,2},

        };
        public int[,] MapLabirint =
        {
            {2,2,2,2,2,2,2,2,2,2},
            {2,0,0,0,0,0,0,2,0,2},
            {2,0,2,0,2,2,0,2,0,2},
            {2,0,2,0,0,2,0,0,0,2},
            {2,0,2,0,2,2,2,2,2,2},
            {2,0,2,0,0,0,2,0,0,2},
            {2,0,2,2,2,0,2,2,0,2},
            {2,0,2,2,0,0,0,0,0,2},
            {2,0,2,2,0,2,2,2,0,2},
            {2,0,2,2,2,2,2,2,2,2},

        };
        public int[,] MapOnluyWool =
        {
            {2,2,2,2,2,2,2,2,2,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,2,2,2,2,2,2,2,2,2},

        };
        public int[,] MapBitva =
        {
            {2,0,0,0,0,0,0,0,0,2},
            {2,0,0,0,0,0,2,0,0,2},
            {2,0,0,1,2,0,2,2,0,2},
            {2,0,2,2,0,0,0,0,0,2},
            {2,0,1,1,1,1,1,1,0,2},
            {2,0,1,1,1,1,1,1,0,2},
            {2,0,0,0,0,0,2,2,0,2},
            {2,0,2,2,0,2,1,0,0,2},
            {2,0,2,0,0,0,0,0,0,2},
            {2,0,0,0,0,0,0,0,0,2},

        };
        public int[,] MapPiramid =
        {
            {1,0,0,0,0,0,0,0,0,1},
            {0,2,0,0,0,0,0,0,2,0},
            {0,0,2,0,0,0,0,2,0,0},
            {0,0,0,2,0,0,2,0,0,0},
            {0,0,0,0,2,2,0,0,0,0},
            {0,0,0,0,2,2,0,0,0,0},
            {0,0,0,2,0,0,2,0,0,0},
            {0,0,2,0,0,0,0,2,0,0},
            {0,2,0,0,0,0,0,0,2,0},
            {1,0,0,0,0,0,0,0,0,1},

        };
        public int[,] MapTurma =
        {
            {2,2,2,2,2,2,2,2,2,2},
            {2,1,1,1,2,0,2,0,0,2},
            {2,1,1,1,2,0,2,0,0,2},
            {2,2,2,2,2,0,2,2,0,2},
            {2,0,0,0,0,0,0,0,0,2},
            {2,2,2,0,0,0,2,2,2,2},
            {2,0,0,0,2,0,2,1,1,2},
            {2,0,0,0,2,0,2,1,1,2},
            {2,0,0,0,2,0,2,1,1,2},
            {2,2,2,2,2,2,2,2,2,2},

        };
    }
}

